{"pages":[],"posts":[{"title":"Happy Valentine's Day","text":"Happy Chinese Valentine’s DayHi my Girl. Although I couldn’t stay with you in the Chinese Velentine’s Day for your parents coming with us, but I just make this website to show you how much I love you even although I don’t provide you with a present, as for the busy work, but I will conpensate with you later, I promise, you have my words! When I think about to make this web, I come up with the thoughts that we spent the really great time in Japan, there are so many great and great moments that we spent with each other. Please don’t forget the ring means our start for our new life in our future! :)) You are mine for ever! You are so cute! Do you remember why you laugh so cute? remember? Life should be like this forever! And I will try my best to make our life to be better! I would like to make our relationship like Nike and the Rabbit! Do you remember the really beautiful scene I have ever seen during my life for vacation, really thanks for letting me to seat near the window of the flying airplane! So beautiful! And do you remember the image of the girl when we were in Jingdu? So cute like you! You would hit me :)) Do you remember the dog we have seen, he is so cute and so smart, he really likes you I think! We are hurry as we walk so many and so many roads, so why not take some noddles? The best noddles I have ever eat! Do you think so? And also the meat? so expensive but should have a try. The bee? We don’t like the bee, right? We have met so many really really cute deers. :)) In fact, I really like you to wear the Kimono, you are so beautiful, I have no much words to express the feeling to see you in the Kimono! Beautiful! And we went to the place with Longmao, so cute either! In fact, we have so many great moments during the vacation! There is really small parts. After our really great trip after the Japan, we go to the seaside, you catch many little crabs, your victories! But as the time limit, I really have so many words that I could say to you! But I just want to tell you: I love you so much than you have ever thought! Hope you will be happier with me during the rest of our life! Love you… Gulu (like the Lord of the Ring’s Gulu, I’m more handsome I think, HAHA :)) )","link":"/2019/08/07/happy-Valentine-s-Day/"}],"tags":[{"name":"Love you","slug":"Love-you","link":"/tags/Love-you/"}],"categories":[]}